# Урок 2. Среда программирования. Знакомство со средой программирования - это комментарии
# Структура программы состоит из следующих частей:
# 1. процедурный стиль
# 2. объектно-ориентированный стиль
# перед компиляцией программы ее надо пересохранять в кодировке UTF-8 -- интерпретатор
''' - выделение группы строк как комментарии
// любая программа должна иметь: жизненный цикл программы
// постановку задачи
// словестный алгоритм
// код программы - ее реализация
// компиляция - формирование готового exe файла

// постановку задачи: вывести на экран строку. Это первая программа на Python
// словестный алгоритм
//1. объявить строковую переменную
//2. Инициализировать переменную текстом. Это первая программа на Python
//3. Вывести переменную на экран
//4. остановить выполнение программы, просмотреть результат
//5. закрыть программу - закрывается после просмотра результата и нажатия ввод
//6. компиляция программы - нажатие кнопки пуск
'''
# В Python динамическая типизация
# 1. объявить строковую переменную
# 2. Инициализировать переменную текстом. Это первая программа на Python
# print(st)
st = "Это первая программа на Python" 
# 3. Вывести переменную на экран
print(st)
# 4. остановить выполнение программы, просмотреть результат
input() # Точка остановки